# Import modules

In [2]:
import sqlite3
import pandas as pd

DB_NAME = 'olist_db.db'

con = sqlite3.connect(DB_NAME)
cur = con.cursor()
cur.execute('pragma encoding=UTF8')

# Calcul le nombre de clients dans la table des customers

In [3]:
nb_clients_query = """
    SELECT COUNT(customer_unique_id) as nb_customers
    FROM olist_customers_dataset
"""

clients_count = pd.read_sql(nb_clients_query, con)
clients_count

   nb_customers
0         96096

# Calcul du nombre de produits dans la table des products

In [4]:
nb_products_query = """
    SELECT COUNT(product_id) as nb_products
    FROM olist_products_dataset
"""

products_count = pd.read_sql(nb_products_query, con)
products_count

   nb_products
0        32951

# Calcul du nombre de produits par catégorie

In [5]:
nb_products_by_cat_query = """
    SELECT COUNT(product_id) as nb_products, product_category_name 
    FROM olist_products_dataset 
    GROUP BY product_category_name
    ORDER BY nb_products DESC
"""

products_by_cat = pd.read_sql(nb_products_by_cat_query,con)
products_by_cat

    nb_products          product_category_name
0          3029                cama_mesa_banho
1          2867                  esporte_lazer
2          2657               moveis_decoracao
3          2444                   beleza_saude
4          2335          utilidades_domesticas
..          ...                            ...
69            5  fashion_roupa_infanto_juvenil
70            5                casa_conforto_2
71            3                       pc_gamer
72            2             seguros_e_servicos
73            1              cds_dvds_musicais

[74 rows x 2 columns]

# Calcul du nombre de commandes dans la table orders

In [6]:
nb_orders_query = """
    SELECT COUNT(order_id) as nb_orders
    FROM olist_orders_dataset
"""

nb_orders = pd.read_sql(nb_orders_query,con)
nb_orders

   nb_orders
0      99441

# Calcul du nombre de commandes par status

In [7]:
nb_order_by_status_query = """
    SELECT COUNT(order_id) as nb_orders, order_status
    FROM olist_orders_dataset
    GROUP BY order_status
"""

nb_order_by_status = pd.read_sql(nb_order_by_status_query,con)
nb_order_by_status

   nb_orders order_status
0          2     approved
1        625     canceled
2          5      created
3      96478    delivered
4        314     invoiced
5        301   processing
6       1107      shipped
7        609  unavailable

# Calcul du nombre de commandes par mois

In [8]:
nb_order_by_month_query = """
    SELECT strftime('%Y-%m', order_approved_at) AS date,
    COUNT(order_id) AS order_by_month
    FROM olist_orders_dataset
    GROUP BY date
    ORDER BY date
"""

nb_order_by_month = pd.read_sql(nb_order_by_month_query,con)
nb_order_by_month

       date  order_by_month
0      None             160
1   2016-09               1
2   2016-10             320
3   2016-12               1
4   2017-01             760
5   2017-02            1765
6   2017-03            2689
7   2017-04            2374
8   2017-05            3693
9   2017-06            3252
10  2017-07            3974
11  2017-08            4348
12  2017-09            4301
13  2017-10            4590
14  2017-11            7395
15  2017-12            5832
16  2018-01            7187
17  2018-02            6706
18  2018-03            7288
19  2018-04            6778
20  2018-05            7066
21  2018-06            6164
22  2018-07            6176
23  2018-08            6620
24  2018-09               1

# Calcul du prix moyen d'une commande

In [9]:
mean_order_query = """
    SELECT AVG(payment_value) AS mean_orders
    FROM olist_order_payments_dataset
"""

mean_order = pd.read_sql(mean_order_query,con)
mean_order

   mean_orders
0    154.10038

# Calcul du score de satisfaction moyen (note moyenne sur les commandes)

In [10]:
mean_score_query = """
    SELECT AVG(review_score) as mean_reviews_score
    FROM olist_order_reviews_dataset
"""

mean_score = pd.read_sql(mean_score_query,con)
mean_score

   mean_reviews_score
0            4.073296

# Calcul de nombre de vendeurs dans la table sellers

In [11]:
nb_sellers_query = """
    SELECT COUNT(seller_id) as nb_sellers
    FROM olist_sellers_dataset
"""

nb_sellers = pd.read_sql(nb_sellers_query,con)
nb_sellers

   nb_sellers
0        3095

# Calcul du nombre de vendeurs par region

In [15]:
nb_sellers_by_state_query = """
    SELECT COUNT(seller_id) as nb_sellers, seller_state
    FROM olist_sellers_dataset
    GROUP BY seller_state
    ORDER BY nb_sellers DESC
"""

nb_sellers_by_state = pd.read_sql(nb_sellers_by_state_query, con)
nb_sellers_by_state

    nb_sellers seller_state
0         1849           SP
1          349           PR
2          244           MG
3          190           SC
4          171           RJ
5          129           RS
6           40           GO
7           30           DF
8           23           ES
9           19           BA
10          13           CE
11           9           PE
12           6           PB
13           5           RN
14           5           MS
15           4           MT
16           2           SE
17           2           RO
18           1           PI
19           1           PA
20           1           MA
21           1           AM
22           1           AC

# Calcul de la quantité de produits vendu par categorie